; domain
(define (domain BLOCKS)

(:requirements :strips :typing :equality)

(:types block)

(:predicates (handempty)
	     (on ?x ?y - block)
	     (ontable ?x - block)
	     (clear ?x - block)
	     (holding ?x - block)
)

(:action pick-up
	 :parameters (?x - block)
     	 :precondition (and (clear ?x) (ontable ?x) (handempty))
     	 :effect       (and 
	 	       (not (ontable ?x))
	     	       (not (clear ?x))
	     	       (not (handempty))
	     	       (holding ?x)
		       )
)

(:action put-down
	 :parameters (?x - block)
     	 :precondition (holding ?x)
     	 :effect       (and 
	 	       (not (holding ?x))
	 	       (clear ?x)
		       (handempty)
		       (ontable ?x)
		       )
)

(:action stack
	 :parameters (?x ?y - block)
     	 :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
     	 :effect       (and 
	 	       (not (holding ?x))
		       (not (clear ?y))
		       (clear ?x)
		       (handempty)
		       (on ?x ?y)
		       )
)


(:action unstack
	 :parameters (?x ?y - block)
	 :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	 :effect       (and 
	 	       (holding ?x)
		       (clear ?y)
		       (not (clear ?x))
		       (not (handempty))
		       (not (on ?x ?y))
		       )
)

)

; problem
(define (problem blocks_words)

(:domain BLOCKS)

(:objects 	  
	  D R A W O E P C - block
)

(:init
	(handempty)
	(clear O)
	(ontable O)
	(clear R)
	(on R P)
	(ontable P)
	(clear E)
	(ontable E)
	(clear D)
	(on D A)
	(on A C)
	(ontable C)
	(clear W)
	(ontable W)
)

(:goal
	(and
	(handempty)
	(clear O)
	(ontable O)
	(clear R)
	(on R P)
	(ontable P)
	(clear E)
	(ontable E)
	(clear D)
	(on D C)
	(on C A)
	(ontable A)
	(clear W)
	(ontable W)
	)
)

)

; plan
1. (unstack d a)
   deleted: (clear d) (handempty) (on d a)
   added: (holding d) (clear a)
   goals met: 9 of 14
2. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 11 of 14
3. (unstack a c)
   deleted: (clear a) (handempty) (on a c)
   added: (holding a) (clear c)
   goals met: 10 of 14
4. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 12 of 14
5. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 11 of 14
6. (stack c a)
   deleted: (holding c) (clear a)
   added: (clear c) (handempty) (on c a)
   goals met: 13 of 14
7. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 11 of 14
8. (stack d c)
   deleted: (holding d) (clear c)
   added: (clear d) (handempty) (on d c)
   goals met: 14 of 14
